Revit 2027 API
Rebar.ReadOnlyParameters Property
 When set to true, Rebar will report all its parameters as read only. For example, the method Parameter::IsReadOnly() for all Rebar Parameters will return true. When set to false, the return value of Parameter::IsReadOnly() will not be affected.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ReadOnlyParameters { get; set; }
Public Property ReadOnlyParameters As Boolean
	Get
	Set
public:
property bool ReadOnlyParameters {
	bool get ();
	void set (bool value);
}
member ReadOnlyParameters : bool with get, set
Property Value
Boolean
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace